[
  {
    "name": "(1)  Except as provided for in Subsections (2) and (3), a licensee shall not advertise or permit any person employed by or affiliated with the licensee to advertise real estate services or property in any medium without clearly and conspicuously identifying in the advertisement the name of the brokerage with which the licensee is affiliated.  The division may not bring an action for enforcement of this subsection after the expiration of four years following the occurrence of the violation."
  },
  {
    "name": "(2)  When it is not reasonable for a licensee to identify the name of the brokerage in an electronic advertisement, the licensee shall ensure the electronic advertisement directly links to a display that clearly and conspicuously identifies the name of the brokerage"
  },
  {
    "name": "(3)  A licensee is not required to identify the name of the brokerage with which the licensee is affiliated if:",
    "law_section_a": "(a)  the licensee advertises a property not currently listed with the brokerage with which the licensee is affiliated;",
    "law_section_b": "(b)  the licensee has an ownership interest in the property; and",
    "law_section_c": "(c)  the advertisement identifies the name of the individual licensee as 'owner-agent' or 'owner-broker.'"

  },
  {
    "name": "(4)  The name of the brokerage identified by a licensee in an advertisement shall be the name of the brokerage as shown on division records."
  },
  {
    "name": "(5)  A team, group, or other marketing entity which includes one or more licensees shall be subject to the same requirements and restrictions with regard to advertising as is an individual licensee."
  },
  {
    "name": "(6)",
    "law_section_a": "(a)  If a licensee advertises a guaranteed sales plan, the advertisement shall include, in a clear and conspicuous manner:(i)  a statement that costs and conditions may apply; and(ii)  information about how to contact the licensee offering the guarantee so as to obtain the disclosures required under Subsection R162-2f-401a(23).",
    "law_section_b": "(b)  Any radio or television advertisement of a guaranteed sales plan shall include a conspicuous statement advising if any conditions and limitations apply."

  }
]
