[
  {
    "name": "(1)  The principal broker of a real estate company shall:",
    "law_section_a": "(a)(i)  if engaged in listing or selling real estate, maintain at least one real estate trust account in a bank or credit union located within the state of Utah; and(ii)  if engaged in property management, refer to trust account rules in Section R162-2f-403b;",
    "law_section_b": " (b)  at the time a real estate trust account is established, or if the trust account is moved to another bank or credit union or the trust account number is changed, notify the division in writing of:(i)  the account number;(ii)  the address of the bank or credit union where the account is located; and(iii)  the type of activity for which the account is used."

  },
  {
    "name": "(2)  A real estate trust account maintained by a principal broker shall be non-interest-bearing, unless:",
    "law_section_a": "(a)  the parties to the transaction agree in writing to deposit the funds in an interest-bearing account;",
    "law_section_b": "(b)  the parties to the transaction designate in writing the person to whom the interest will be paid upon completion or failure of the sale;",
    "law_section_c": "(c)  the person designated under Subsection (2)(b):(i)  qualifies at the time of payment as a non-profit organization under Section 501(c)(3) of the Internal Revenue Code; and(ii)  operates exclusively to provide grants to affordable housing programs in Utah; and",
    "law_section_d": "(d)  the affordable housing program that is the recipient of the grant under Subsection (2)(c)(ii) qualifies at the time of payment as a non-profit organization under Section 501(c)(3) of the Internal Revenue Code."

  },
  {
    "name": "(3)  A principal broker may not deposit into the principal broker's real estate trust account funds received in connection with rental of tourist accommodations where the rental period is less than 30 consecutive days." 
  },
  {
    "name": "(4)  Records of deposits to a real estate trust account shall include:",
    "law_section_a": "(a)  transaction number or unique client identifier, as applicable pursuant to Subsection R162-2f-401c(1)(j);",
    "law_section_b": "(b)  identification of payee and payor;",
    "law_section_c": "(c)  amount of deposit;",
    "law_section_d": "(d)  location of property subject to the transaction; and",
    "law_section_e": " (e)  date and place of deposit."


  },
  {
    "name": "(5)  Except for electronic transfers provided for in Subsection (6), any instrument by which funds are disbursed from a real estate or property management trust account shall include:",
    "law_section_a": "(a)  the business name of the registered entity;",
    "law_section_b": "(b)  the address of the registered entity;",
    "law_section_c": "(c)  clear identification of the trust account from which the disbursement is made, including:(i)  account name; and(ii)  account number;(iii)  transaction number or unique client identification, as applicable, pursuant to Subsection R162-2f-401c(1)(k);(iv)  date of disbursement;(v)  clear identification of payee and payor;(vi)  amount disbursed;(vii)  notation identifying the purpose for disbursement; and(viii)  check number, wire transfer number, or equivalent bank or credit union instrument identification."

  },
  {
    "name": "(6)  Any instrument by which funds are disbursed from a real estate or property management trust account shall include those items required in Subsection (5), except when a required item is not able to be included due to the inherent limitations of such instrument. In a circumstance in which any item required by Subsection (5) is not included in the instrument, the principal broker shall still comply with the reconciliation requirements of this section and Section R162-2f-401k."
  },
  {
    "name": "(7)  Any instrument of conveyance that is voided shall be clearly marked with the term 'void' and the original instrument retained pursuant to Section R162-2f-401k."
  },
  {
    "name": "(8)  If both parties to a contract make a written claim to money held in a principal broker's trust fund and the principal broker cannot determine from any signed agreement which party's claim is valid, the principal broker may:",
    "law_section_a": "(a)  interplead the funds into court and thereafter disburse:(i)  upon written authorization of the party who will not receive the funds; or(ii)  pursuant to the order of a court of competent jurisdiction; or",
    "law_section_b": "(b)  within 15 days of receiving written notice that both parties claim the funds, refer the parties to mediation if:(i)  no party has filed a civil suit arising out of the transaction; and(ii)  the parties have contractually agreed to submit disputes arising out of their contract to mediation."

  },
  {
    "name": "(9)  If a principal broker is unable to disburse trust funds within three years after the failure of a transaction, the principal broker shall remit the funds to the State Treasurer's Office as unclaimed property pursuant to Title 67, Chapter 4a, Revised Uniform Unclaimed Property Act ."
  },
  {
    "name": "(10)  Trust account reconciliation requirements are as follows: For each real estate or property management trust account operated by a registered entity, the principal broker of the entity shall:",
    "law_section_a": " (a)  maintain a date-sequential record of each deposit to and disbursement from the account, including a cross-reference to the information specified in Subsection R162-2f-401c(1)(j);",
    "law_section_b": "(b)  maintain a current, running total of the balance contained in the trust account;",
    "law_section_c": "(c)(i)  maintain records sufficient to detail the final disposition of any funds associated with each transaction; and(ii)  ensure that each closed transaction balances to zero;",
    "law_section_d": "(d)  reconcile the brokerage trust account records with the bank or credit union records at least monthly;",
    "law_section_e": " (e)  reconcile the brokerage trust account records with the brokerage client account records at least monthly; and",
    "law_section_f": "(f)  upon request, make the trust account records available to the division for auditing or investigation."

  },
  {
    "name": "(11)  The principal broker shall notify the division within 30 days if:",
    "law_section_a": "(a)  the principal broker receives, from a bank or credit union in which the principal broker maintains a real estate or property management trust account, documentation to evidence that the trust account is out of balance; and",
    "law_section_b": "(b)  the imbalance cannot be cured within the 30-day notification period."

  },
  {
    "name": "(12)  A real estate trust account shall be used for the purpose of securing client funds:",
    "law_section_a": "(a)  deposited with the principal broker in connection with a real estate transaction regulated under Title 61, Chapter 2f, Real Estate Licensing and Practices Act;",
    "law_section_b": "(b)  deposited under a Real Estate Purchase Contract, construction contract, or other agreement that provides for the construction of a dwelling, if the principal broker is also a builder or developer; or",
    "law_section_c": "(c)  collected in the performance of property management duties, pursuant to Subsection (13)."

  },
  {
    "name": "(13)  A principal broker violates Subsection 61-2f-401(4)(b) if:",
    "law_section_a": "(a)  the principal broker:(i)  deposits more than $1000 of the principal broker's own funds into a real estate trust account; or(ii)  fails to transfer funds due to the principal broker or an affiliated licensee into the operating account within 60 days from the closing or termination of the real estate transaction; or(iii)  fails to transfer earnings for property management services out of the property management trust account and into an operating account within 60 days of the date the earnings are earned according to contract and received."

    
  },
  {
    "name": "(14)  A principal broker of a real estate sales company who regularly engages in property management on behalf of seven or more individual units shall establish at least one property management trust account that is:",
    "law_section_a": "(a)  separate from the real estate trust account; and",
    "law_section_b": "(b)  operated in accordance with Section R162-2f-403b."

  },
  {
    "name": "(15)  A principal broker may not pay a commission from a real estate trust account, without first:",
    "law_section_a": "(a)  obtaining written authorization from the buyer and seller, or other parties having an interest in the funds, through contract or otherwise;",
    "law_section_b": "(b)  closing or otherwise terminating the transaction;",
    "law_section_c": "(c)  delivering the settlement statement to the buyer and seller;",
    "law_section_d": "(d)  ensuring that the buyer or seller whom the principal broker represents has been paid the amount due as determined by the settlement statement;",
    "law_section_e": "(e)  making a record of each disbursement; and",
    "law_section_f": "(f)  depositing the funds into the principal broker's operating account prior to further disbursing the funds."

  },
  {
    "name": "(16)  A principal broker may disburse funds from a real estate trust account only in accordance with:",
    "law_section_a": "(a)  specific language in the Real Estate Purchase Contract authorizing disbursement;",
    "law_section_b": "(b)  other proper written authorization of the parties having an interest in the funds;",
    "law_section_c": "(c)  this section; or",
    "law_section_d": "(d)  court order."

  },
  {
    "name": "(17)  A principal broker may not release for construction purposes those funds held as deposit money under an agreement that provides for the construction of a dwelling unless the purchaser authorizes such disbursement in writing."

  },
  {
    "name": "(18)  A principal broker may not release earnest money or other trust funds associated with a failed transaction unless:",
    "law_section_a": "(a)  a condition in the Real Estate Purchase Contract authorizing disbursement has occurred; or",
    "law_section_b": "(b)  the parties execute a separate signed agreement containing instructions and authorization for disbursement."

  },
  {
    "name": "(19)  With the client's written consent, a principal broker may reallocate earnest money funds from a failed transaction held in a trust account as earnest money for the same client in another transaction."
  
  }
]
