[
  {
    "name": "(1)  The principal broker of a property management company shall:",
    "law_section_a": "(a)(i)  if regularly engaged in property management on behalf of seven or more individual units, establish at least one property management trust account that is separate from the principal broker's real estate trust account and is maintained in a bank or credit union located within the state of Utah; and(ii)  if engaged in listing or selling real estate, or if regularly engaged in property management on behalf of six or fewer individual units, maintain at least one real estate trust account in a bank or credit union located within the state of Utah and maintained pursuant to Section R162-2f-403a;",
    "law_section_b": " (b)  at the time a property management trust account is established, or if the trust account is moved to another bank or credit union or the trust account number is changed, notify the division in writing within ten business days of:(i)  the account number;(ii)  the address of the bank or credit union where the account is located; and(iii)  the type of activity for which the account is used."

  },
  {
    "name": "(2)  A property management trust account maintained by a principal broker shall be non-interest-bearing, unless:",  
    "law_section_a": "(a)  the parties to the transaction agree in writing to deposit the funds in an interest-bearing account;",
    "law_section_b": "(b)  the parties to the transaction designate in writing the person to whom the interest will be paid upon completion or failure of the transaction;",
    "law_section_c": "(c)  the person designated under Subsection (2)(b):(i)  qualifies at the time of payment as a non-profit organization under Section 501(c)(3) of the Internal Revenue Code; and(ii)  operates exclusively to provide grants to affordable housing programs in Utah; and(d)  the affordable housing program that is the recipient of the grant under Subsection (2)(c)(ii) qualifies at the time of payment as a non-profit organization under Section 501(c)(3) of the Internal Revenue Code."


  },
  {
    "name": "(3)  A principal broker may not deposit into the principal broker's property management account funds received in connection with rental of tourist accommodations where the rental period is less than 30 consecutive days."
  },
  {
    "name": "(4)  Records of deposits to a property management trust account shall include:",          
    "law_section_a": "(a)  transaction number or unique client identifier, as applicable pursuant to Subsection R162-2f-401c(1)(j);",
    "law_section_b": "(b)  identification of payee and payor;",
    "law_section_c": "(c)  amount of deposit;",
    "law_section_d": "(d)  location of property subject to the transaction; and",
    "law_section_e": "(e)  date and place of deposit."
  },
  {
    "name": "(5)  Except for electronic transfers provided for in Subsection (6), any instrument by which funds are disbursed from a real estate or property management trust account shall include:",
    "law_section_a": "(a)  the business name of the registered entity;",
    "law_section_b": "(b)  the address of the registered entity;",
    "law_section_c": "(c)  clear identification of the trust account from which the disbursement is made, including:(i)  account name;(ii)  account number;(iii)  transaction number or unique client identification, as applicable, pursuant to Subsection R162-2f-401c(1)(k);(iv)  date of disbursement;(v)  clear identification of payee and payor;(vi)  amount disbursed;(vii)  notation identifying the purpose for disbursement; and(viii)  check number, wire transfer number, or equivalent bank or credit union instrument identification."

  },
  {
    "name": "(6)  Any instrument by which funds are disbursed from a real estate or property management trust account shall include those items required in Subsection (5), except when a required item is not able to be included due to the inherent limitations of such instrument. In a circumstance in which any item required by Subsection (5) is not included in the instrument, the principal broker shall still comply with the reconciliation requirements of this section and Section 401k."
  },
  {
    "name": "(7)  Any instrument of conveyance that is voided shall be clearly marked with the term 'void' and the original instrument retained pursuant to Section R162-2f-401k."
  },
  {
    "name": "(8)  If more than one party to a contract makes a written claim to money held in a principal broker's trust fund and the principal broker cannot determine from any signed agreement which party's claim is valid, the principal broker may:",
    "law_section_a": "(a)  interplead the funds into court and thereafter disburse:(i)  upon written authorization of the parties who will not receive the funds; or(ii)  pursuant to the order of a court of competent jurisdiction; or",
    "law_section_b": "(b)  within 15 days of receiving written notice that more than one party claims the funds, refer the parties to mediation if:(i)  no party has filed a civil suit arising out of the transaction; and(ii)  the parties have contractually agreed to submit disputes arising out of their contract to mediation."

  },
  {
    "name": "(9)  If a principal broker is unable to disburse trust funds within three years after the funds are due to be disbursed, the principal broker shall remit the funds to the State Treasurer's Office as unclaimed property pursuant to Title 67, Chapter 4a, Revised Uniform Unclaimed Property Act."
  },
  {
    "name": "(10)  Trust account reconciliation requirements are as follows: For each real estate or property management trust account operated by a registered entity, the principal broker of the entity shall:",
    "law_section_a": "(a)  maintain a date-sequential record of each deposit to, and disbursement from, the account, including a cross-reference to the information specified in Subsection R162-2f-401c(1)(j);",
    "law_section_b": "(b)  maintain a current, running total of the balance contained in the trust account;",
    "law_section_c": "(c)(i)  maintain records sufficient to detail the final disposition of the funds associated with each transaction; and(ii)  ensure that each closed transaction balances to zero;",
    "law_section_d": "(d)  reconcile the brokerage trust account records with the bank or credit union records at least monthly;",
    "law_section_e": "(e)  reconcile the brokerage trust account records with the brokerage client accounts at least monthly; and",
    "law_section_f": "(f)  upon request, make the trust account records available to the division for auditing or investigation."

  },
  {
    "name": "(11)  The principal broker shall notify the division within 30 days if:",
    "law_section_a": "(a)  the principal broker receives, from a bank or credit union in which the principal broker maintains a real estate or property management trust account, documentation to evidence that the trust account is out of balance; and",
    "law_section_b": "(b)  the imbalance cannot be cured within the 30-day notification period."

  },
  {
    "name": "(12)  A property management trust account shall be used for the purpose of securing:",
    "law_section_a": "(a)  tenant security deposits;",
    "law_section_b": "(b)  rents;",
    "law_section_c": "(c)  money tendered by a property owner as a reserve fund or for payment of unexpected expenses; and",
    "law_section_d": "(d)  if the principal broker has not established a separate real estate trust account, client funds deposited with the principal broker in connection with a real estate transaction regulated under Title 61, Chapter 2f, Real Estate Licensing and Practices Act."

  },
  {
    "name": "(13)  A principal broker violates Subsection 61-2f-401(4)(b) if:",
    "law_section_a": "(a)  the principal broker deposits into a property management trust account funds belonging to the principal broker without:(i)  maintaining records to clearly identify the total amount belonging to the principal broker; or(ii)  performing a monthly line-item reconciliation of the deposits and withdrawals of funds belonging to the principal broker; or",
    "law_section_b": "(b)  the principal broker:(i)  deposits more than $10,000 of the principal broker's own funds into the property management trust account; or(ii)  fails to transfer earnings for property management services out of the property management trust account and into the operating account within 60 days from the date the earnings are earned according to contract and received."

  },
  {
    "name": "(14)  A principal broker may disburse funds from a property management trust account only in accordance with:",
    "law_section_a": "(a)  specific language in the property management contract or tenant lease agreement, as applicable, authorizing disbursement;",
    "law_section_b": "(b)  other proper written authorization of the parties having an interest in the funds;",
    "law_section_c": "(c)  this section; or",
    "law_section_d": "(d)  court order."

  },
  {
    "name": "(15)  A principal broker who transfers funds from a property management trust account for any purpose shall maintain records to clearly evidence that:",
    "law_section_a": "(a)  prior to making the transfer, the principal broker verified the money as belonging to the property owner for whose benefit, or on whose instruction, the funds are transferred;",
    "law_section_b": "(b)  any money transferred into an operating account as a commission or for the principal broker's property management fee is earned according to the terms of the principal broker's contract with the property owner;",
    "law_section_c": "(c)  any transfer for maintenance, repair, or similar purpose is:(i)  authorized according to the terms of the applicable property management contract, tenant lease agreement, or other instruction of the property owner; and(ii)  used strictly for the purpose for which the transfer is authorized, with any excess returned to the trust account."

  },
  {
    "name": "(16)  A principal broker may not pay a commission or transfer funds for the principal broker's property management fee directly from the property management trust account but shall first deposit the funds into the principal broker's operating account prior to further disbursing the funds."
  }
]
